{
  "Before": {
    "desire": {
      "title": "Try us",
      "text": "A charming desktop bin that keeps up with your flavor experiments. Toss scraps into the worm chamber and grow fresh herbs beside it. Who knows—your next craving might be growing already."
    },
    "routine": {
      "title": "Try us",
      "text": "Our desktop device comes with a tidy collection box and clearly divided zones: one for scraps, one for your favorite herbs. It’s composting made trackable, portable, and plan-able."
    },
    "ethos": {
      "title": "Try us",
      "text": "Powered by real worms and zero guilt. Watch food scraps break down into worm cast while your microgreens sprout next door. You’re not throwing food away—you’re growing your values."
    }
  },
  "During": {
    "desire": {
      "title": "Try us",
      "text": "A cute, desk-friendly bin that’s both compost and companion. Let your scraps disappear under the surface while thyme and basil reach toward the light. Minimal smell, maximum style."
    },
    "routine": {
      "title": "Try us",
      "text": "A clean-lined compost system that slides onto your desk. One side: food waste into worm-powered soil. The other side: productivity in the form of sprouting greens. Function. Fulfilled."
    },
    "ethos": {
      "title": "Try us",
      "text": "Finish your meal with intention. Drop the peels into a soft-lidded compost bin that lives beside your plant—your everyday ceremony of return. One ritual closes, another one begins."
    }
  },
  "After": {
    "desire": {
      "title": "Try us",
      "text": "A compact, low-smell, genuinely adorable compost unit that lives quietly on your desk. Scraps in, castings out, mint growing on the side. Zero guilt. Zero clutter."
    },
    "routine": {
      "title": "Try us",
      "text": "A structured, stackable compost + plant box. Slide your scraps into the collection tray, let worms do the work, and water your cilantro on the side. Clean system. Closed loop."
    },
    "ethos": {
      "title": "Try us",
      "text": "A closed-cycle compost unit with a worm-powered core and a companion plant growing right beside it. Sit it on your table. Feed it with care. Watch your convictions sprout."
    }
  }
}