{
  "Before": {
    "desire": {
      "title": "🌱 The Forager of Whim (Before × Desire)",
      "missed": "You are most attuned to food before it ever hits the plate—drawn by the thrill of discovery. Intuition and curiosity guide your choices more than structure.\n\nWhat you might have missed: Spontaneous grocery runs may leave you with more perishable foods than you can use. Your plant choices might be driven by beauty or novelty, not resilience—leading to early wilt or unnecessary duplicates.\n\nTry this: Channel your creativity into leftovers too—design a “surprise dish” from whatever’s left in the fridge. Let the whim continue into waste reduction."
    },
    "routine": {
      "title": "🗺 The Cartographer (Before × Routine)",
      "missed": "You feel grounded in structure and derive satisfaction from planned meals and systematized shopping.\n\nWhat you might have missed: Overplanning can lead to overbuying—and little room for improvising with leftovers. In your garden, tight spacing or too much variety may compromise airflow or resource use.\n\nTry this: Make space in your week for one “open” meal—use it to integrate odds and ends or harvests you didn’t account for."
    },
    "ethos": {
      "title": "🌾 The Soil Believer (Before × Ethos)",
      "missed": "You see every bite as a choice with ethical weight. Food, to you, is a gesture of care—toward land, people, and principle.\n\nWhat you might have missed: Foods with strong values can also come with short shelf lives or hidden energy costs. Similarly, your passion for seed-to-plant growing might lead to overwatering or mismatched timing.\n\nTry this: Add sustainability to your ethics not just in what you choose, but how you use and grow it. Even the most righteous ingredient deserves thoughtful storage and timing."
    }
  },
  "During": {
    "desire": {
      "title": "🎨 The Sensorialist (During × Desire)",
      "missed": "You savor with every sense—color, aroma, texture, and sound are part of your nourishment.\n\nWhat you might have missed: Aesthetic meals can generate waste if edible trimmings are discarded for beauty. Eye-catching crops you grow may not thrive in your environment, leading to resource-heavy care.\n\nTry this: Treat your trimmings like supporting actors—find simple ways to bring those stems and scraps into their own spotlight."
    },
    "routine": {
      "title": "⏱ The Formula Seeker (During × Routine)",
      "missed": "You eat with intention and precision. For you, food is timing, fuel, and optimization.\n\nWhat you might have missed: Rigid portions may leave small extras unaccounted for—and therefore wasted. Your focus on utilitarian plants could overlook soil diversity and seasonal cycles.\n\nTry this: Build flexibility into your formula. A planned “use-it-up” meal or a rotating plant bed can do wonders without breaking your system."
    },
    "ethos": {
      "title": "🕯 The Ritualist (During × Ethos)",
      "missed": "You eat with presence. Every meal is a chance to reconnect—with yourself, with others, or with place.\n\nWhat you might have missed: Your devotion to meaningful meals can lead to over-preparing or under-saving. Symbolic plants in your home might not always align with actual use or climate.\n\nTry this: Extend your ritual into what happens after the plate is cleared. Make space for leftovers in your story—not just your fridge."
    }
  },
  "After": {
    "desire": {
      "title": "💨 The Refresher (After × Desire)",
      "missed": "You chase lightness after the meal—physical, mental, spatial.\n\nWhat you might have missed: Your desire to “clear the slate” may make you overly quick to toss small remainders. Fast-growing greens you favor may be delicate and easily wasted.\n\nTry this: Let refreshment come from reuse. A single spoon of something leftover can become tomorrow’s topping or spread—keeping your plate and conscience light."
    },
    "routine": {
      "title": "📦 The Arranger (After × Routine)",
      "missed": "You find closure in clean-up. Nothing satisfies quite like a well-organized fridge or compost system.\n\nWhat you might have missed: Rigid order may lead you to throw away foods that “don’t fit”—visually, spatially, or by date. Your garden structure might be too energy-intensive to maintain.\n\nTry this: Allow your system to include soft edges. Even a crumpled carrot deserves a place in the plan."
    },
    "ethos": {
      "title": "🧶 The Reweaver (After × Ethos)",
      "missed": "You find meaning in what remains. Compost, leftovers, bits and pieces—they’re not waste, but potential.\n\nWhat you might have missed: Holding onto everything can sometimes lead to spoilage or cold storage overflow. Similarly, trying to regrow everything from scraps might demand more resources than expected.\n\nTry this: Ask not just “Can I save this?” but “Will I use it?” Let care guide action, not just collection."
    }
  }
}