{
  "Before": {
    "desire": "🌱 The Forager of Whim (Before × Desire)\nThis person feels most connected to food before it even enters the kitchen—the thrill is in the search. What drives their decisions is spontaneity and instinct.\nThey are likely to browse markets on a whim, follow cravings instead of recipes, and be drawn to rare or seasonal ingredients. Their pantry may be inconsistent but full of surprises. Planning isn’t their strength, but excitement certainly is.",
    "routine": "🗺 The Cartographer (Before × Routine)\nThis person connects to food most deeply during the planning and procurement phase. They are driven by structure and routine.\nThey probably meal-plan weekly, have a mapped-out grocery list, and find satisfaction in efficient shopping. Predictability gives them peace, and they likely make thoughtful, budget-conscious food choices over spontaneous ones.",
    "ethos": "🌾 The Soil Believer (Before × Ethos)\nThis person is most attached to the food cycle before meals, especially the origins and ethical choices. What drives them is a sense of responsibility and values.\nThey likely choose local, organic, or self-grown foods, and may participate in CSA programs or farmer's markets. Food is more than nourishment—it is a way to act on what they believe in. Every item in their basket reflects a conscious decision."
  },
  "During": {
    "desire": "🎨 The Sensorialist (During × Desire)\nThis person finds their deepest connection to food while eating, and they are driven by sensual pleasure.\nThey likely choose meals that are colorful, aromatic, and textured. They might savor small bites and enjoy shared meals in vibrant settings. For them, how the food looks and feels is just as important as how it tastes. Presentation, mood, and atmosphere guide their choices.",
    "routine": "⏱ The Formula Seeker (During × Routine)\nThis person is most attuned to food during the act of eating, but what drives them is efficiency and regulation.\nThey probably eat at the same times daily, value nutrient balance, and lean into meal prep and portion control. Eating is an optimization task—fuel for productivity. Their behavior leans toward pragmatism and time management rather than indulgence.",
    "ethos": "🕯 The Ritualist (During × Ethos)\nThis person’s bond with food peaks during meals, and their behavior is guided by values and internal rhythm.\nThey might light candles before eating, put away screens, or say a quiet thanks before the first bite. Eating is sacred—a moment to reconnect with oneself or with others. Food is not just fuel; it's a ritual that grounds and centers."
  },
  "After": {
    "desire": "💨 The Refresher (After × Desire)\nThis person feels most connected to food in the aftermath—when the space is cleared, and the body feels light. They’re driven by the desire for renewal.\nThey might tidy up immediately after meals, seek balance after indulgence, or opt for foods that “don’t weigh them down.” They are likely to be drawn to cleansing routines and mindful snacking. They act not out of guilt but pursuit of feeling fresh.",
    "routine": "📦 The Arranger (After × Routine)\nThis person’s deepest tie to food is after it’s eaten—they find comfort in restoring order. They’re driven by the logic of systems and flow.\nThey likely clean the kitchen in a particular sequence, label leftovers, compost methodically, and track grocery use. They value predictability and find satisfaction in minimizing waste and managing household food efficiently.",
    "ethos": "🧶 The Reweaver (After × Ethos)\nThis person feels most attached to food when reflecting on what remains. They are driven by the values of reuse and continuity.\nThey are likely to repurpose leftovers, avoid throwing anything away, and see even scraps as future ingredients or compost. For them, waste is not an end—it’s part of an ongoing story where food, life, and meaning are intricately linked."
  }
}